name: "CaffeNet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 227 dim: 227 } }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
  }
}

layer {
  name: "conv1t"
  type: "Deconvolution"
  bottom: "conv1"
  top: "conv1t"
  convolution_param {
    num_output: 3
    stride: 4
    kernel_size: 11
  }
}